;----------------------------------------------------------
;版权信息：
;作者信息：
;编制日期：
;程序功能：
;
;
;使用方法：
;
;入口信息：
;
;出口信息：
;
;版本信息：
;----------------------------------------------------------
;修改信息：（对应版本，修改日期，修改者，修改原因，修改位置）
;-----------------------------------------------------------
code	segment 'code'			;定义代码段
	assume cs:code
	dw 0123h,0456h,0789h,0abch,0defh,0fedh,0cbah,0987h
	dw 0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0
start:	mov ax,cs			;建立DS段地址
	mov ss,ax
	mov sp,30h
	mov bx,0
	mov cx,8

s:	push cs:[bx]
	add bx,2
	loop s
	
	mov bx,0
	mov cx,8

s0:	pop cs:[bx]
	add bx,2
	loop s0

	mov ax,4c00h
	int 21h				;利用功能调用返回DOS
code	ends				;代码段结束
	end start
					;汇编结束，同时指明程序起始点
